# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв)
# в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов,
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает
# в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”,
# если с ритмом все не в порядке
#
# *Пример:*
#
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

def get_ritm(str):
    res = [i.split("-") for i in str.split("  ")]
    res1 = ["".join(i) for i in res]
    vowels = "ёуеыаоэяию"
    f = 0
    for i in res1:
        f += sum([1 for k in i if i in vowels])
    if f % len(res) != 0:
        print("Пам парам")
    else:
        print("Парам пам-пам")


get_ritm(input())
